Revit 2024 API
ViewSchedule.IsValidFamilyForNoteBlock Method
 Checks whether a family can be used for a note block.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidFamilyForNoteBlock(
	Document document,
	ElementId familyId
)
Visual Basic
Public Shared Function IsValidFamilyForNoteBlock ( _
	document As Document, _
	familyId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidFamilyForNoteBlock(
	Document^ document,
	ElementId^ familyId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
familyId
Type: Autodesk.Revit.DB.ElementId
 The family ID to check.
Return Value
 True if the family can be used for a note block, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace